Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSmu_regdef.h
/**
 * \file IfxSmu_regdef.h
 * \brief
 * \copyright Copyright (c) 2016 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2016-01-21 13:32:24 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Smu_Registers SmuRegisters
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Smu_Registers_Bitfields Bitfields
 * \ingroup IfxLld_Smu_Registers
 * 
 * \defgroup IfxLld_Smu_Registers_union Register unions
 * \ingroup IfxLld_Smu_Registers
 * 
 * \defgroup IfxLld_Smu_Registers_struct Memory map
 * \ingroup IfxLld_Smu_Registers
 */
#ifndef IFXSMU_REGDEF_H
#define IFXSMU_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Smu_Bitfields
 * \{  */
/** \brief SMU Access Enable Register 0 */
typedef struct _Ifx_SMU_ACCEN0_Bits
{
    Ifx_UReg_32Bit EN0:1;             /**< \brief [0:0] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN1:1;             /**< \brief [1:1] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN2:1;             /**< \brief [2:2] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN3:1;             /**< \brief [3:3] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN4:1;             /**< \brief [4:4] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN5:1;             /**< \brief [5:5] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN6:1;             /**< \brief [6:6] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN7:1;             /**< \brief [7:7] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN8:1;             /**< \brief [8:8] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN9:1;             /**< \brief [9:9] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN10:1;            /**< \brief [10:10] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN11:1;            /**< \brief [11:11] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN12:1;            /**< \brief [12:12] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN13:1;            /**< \brief [13:13] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN14:1;            /**< \brief [14:14] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN15:1;            /**< \brief [15:15] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN16:1;            /**< \brief [16:16] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN17:1;            /**< \brief [17:17] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN18:1;            /**< \brief [18:18] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN19:1;            /**< \brief [19:19] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN20:1;            /**< \brief [20:20] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN21:1;            /**< \brief [21:21] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN22:1;            /**< \brief [22:22] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN23:1;            /**< \brief [23:23] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN24:1;            /**< \brief [24:24] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN25:1;            /**< \brief [25:25] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN26:1;            /**< \brief [26:26] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN27:1;            /**< \brief [27:27] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN28:1;            /**< \brief [28:28] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN29:1;            /**< \brief [29:29] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN30:1;            /**< \brief [30:30] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
    Ifx_UReg_32Bit EN31:1;            /**< \brief [31:31] Access Enable for Master TAG ID ${y} - EN${y} (rw) */
} Ifx_SMU_ACCEN0_Bits;

/** \brief SMU Access Enable Register 1 */
typedef struct _Ifx_SMU_ACCEN1_Bits
{
    Ifx_UReg_32Bit reserved_0:32;     /**< \brief [31:0] \internal Reserved */
} Ifx_SMU_ACCEN1_Bits;

/** \brief Alarm Debug Register */
typedef struct _Ifx_SMU_AD_Bits
{
    Ifx_UReg_32Bit DF0:1;             /**< \brief [0:0] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF1:1;             /**< \brief [1:1] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF2:1;             /**< \brief [2:2] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF3:1;             /**< \brief [3:3] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF4:1;             /**< \brief [4:4] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF5:1;             /**< \brief [5:5] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF6:1;             /**< \brief [6:6] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF7:1;             /**< \brief [7:7] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF8:1;             /**< \brief [8:8] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF9:1;             /**< \brief [9:9] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF10:1;            /**< \brief [10:10] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF11:1;            /**< \brief [11:11] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF12:1;            /**< \brief [12:12] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF13:1;            /**< \brief [13:13] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF14:1;            /**< \brief [14:14] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF15:1;            /**< \brief [15:15] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF16:1;            /**< \brief [16:16] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF17:1;            /**< \brief [17:17] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF18:1;            /**< \brief [18:18] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF19:1;            /**< \brief [19:19] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF20:1;            /**< \brief [20:20] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF21:1;            /**< \brief [21:21] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF22:1;            /**< \brief [22:22] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF23:1;            /**< \brief [23:23] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF24:1;            /**< \brief [24:24] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF25:1;            /**< \brief [25:25] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF26:1;            /**< \brief [26:26] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF27:1;            /**< \brief [27:27] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF28:1;            /**< \brief [28:28] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF29:1;            /**< \brief [29:29] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF30:1;            /**< \brief [30:30] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
    Ifx_UReg_32Bit DF31:1;            /**< \brief [31:31] Diagnosis flag for alarm ${z} belonging to alarm group i. - DF${z} (rh) */
} Ifx_SMU_AD_Bits;

/** \brief Alarm Executed Status Register */
typedef struct _Ifx_SMU_AEX_Bits
{
    Ifx_UReg_32Bit IRQ0STS:1;         /**< \brief [0:0] IRQ0 Request Status - IRQ0STS (rh) */
    Ifx_UReg_32Bit IRQ1STS:1;         /**< \brief [1:1] IRQ1 Request Status - IRQ1STS (rh) */
    Ifx_UReg_32Bit IRQ2STS:1;         /**< \brief [2:2] IRQ2 Request Status - IRQ2STS (rh) */
    Ifx_UReg_32Bit RST0STS:1;         /**< \brief [3:3] RST0 Request Status - RST0STS (rh) */
    Ifx_UReg_32Bit RST1STS:1;         /**< \brief [4:4] RST1 Request Status - RST1STS (rh) */
    Ifx_UReg_32Bit RST2STS:1;         /**< \brief [5:5] RST2 Request Status - RST2STS (rh) */
    Ifx_UReg_32Bit RST3STS:1;         /**< \brief [6:6] RST3 Request Status - RST3STS (rh) */
    Ifx_UReg_32Bit RST4STS:1;         /**< \brief [7:7] RST4 Request Status - RST4STS (rh) */
    Ifx_UReg_32Bit RST5STS:1;         /**< \brief [8:8] RST5 Request Status - RST5STS (rh) */
    Ifx_UReg_32Bit NMISTS:1;          /**< \brief [9:9] NMI Request Status - NMISTS (rh) */
    Ifx_UReg_32Bit RSTSTS:1;          /**< \brief [10:10] RST Request Status - RSTSTS (rh) */
    Ifx_UReg_32Bit EMSSTS:1;          /**< \brief [11:11] EMS Request Status - EMSSTS (rh) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit IRQ0AEM:1;         /**< \brief [16:16] IRQ0 AEM - IRQ0AEM (rh) */
    Ifx_UReg_32Bit IRQ1AEM:1;         /**< \brief [17:17] IRQ1 AEM - IRQ1AEM (rh) */
    Ifx_UReg_32Bit IRQ2AEM:1;         /**< \brief [18:18] IRQ2 AEM - IRQ2AEM (rh) */
    Ifx_UReg_32Bit RST0AEM:1;         /**< \brief [19:19] RST0 AEM - RST0AEM (rh) */
    Ifx_UReg_32Bit RST1AEM:1;         /**< \brief [20:20] RST1 AEM - RST1AEM (rh) */
    Ifx_UReg_32Bit RST2AEM:1;         /**< \brief [21:21] RST2 AEM - RST2AEM (rh) */
    Ifx_UReg_32Bit RST3AEM:1;         /**< \brief [22:22] RST3 AEM - RST3AEM (rh) */
    Ifx_UReg_32Bit RST4AEM:1;         /**< \brief [23:23] RST4 AEM - RST4AEM (rh) */
    Ifx_UReg_32Bit RST5AEM:1;         /**< \brief [24:24] RST5 AEM - RST5AEM (rh) */
    Ifx_UReg_32Bit NMIAEM:1;          /**< \brief [25:25] NMI AEM - NMIAEM (rh) */
    Ifx_UReg_32Bit RSTAEM:1;          /**< \brief [26:26] RST AEM - RSTAEM (rh) */
    Ifx_UReg_32Bit EMSAEM:1;          /**< \brief [27:27] EMS AEM - EMSAEM (rh) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_SMU_AEX_Bits;

/** \brief Alarm Executed Status Clear Register */
typedef struct _Ifx_SMU_AEXCLR_Bits
{
    Ifx_UReg_32Bit IRQ0CLR:1;         /**< \brief [0:0] IRQ0 Request Status Clear - IRQ0CLR (w) */
    Ifx_UReg_32Bit IRQ1CLR:1;         /**< \brief [1:1] IRQ1 Request Status Clear - IRQ1CLR (w) */
    Ifx_UReg_32Bit IRQ2CLR:1;         /**< \brief [2:2] IRQ2 Request Status Clear - IRQ2CLR (w) */
    Ifx_UReg_32Bit RST0CLR:1;         /**< \brief [3:3] RST0 Request Status Clear - RST0CLR (w) */
    Ifx_UReg_32Bit RST1CLR:1;         /**< \brief [4:4] RST1 Request Status Clear - RST1CLR (w) */
    Ifx_UReg_32Bit RST2CLR:1;         /**< \brief [5:5] RST2 Request Status Clear - RST2CLR (w) */
    Ifx_UReg_32Bit RST3CLR:1;         /**< \brief [6:6] RST3 Request Status Clear - RST3CLR (w) */
    Ifx_UReg_32Bit RST4CLR:1;         /**< \brief [7:7] RST4 Request Status Clear - RST4CLR (w) */
    Ifx_UReg_32Bit RST5CLR:1;         /**< \brief [8:8] RST5 Request Status Clear - RST5CLR (w) */
    Ifx_UReg_32Bit NMICLR:1;          /**< \brief [9:9] NMI Request Status Clear - NMICLR (w) */
    Ifx_UReg_32Bit RSTCLR:1;          /**< \brief [10:10] RST Request Status Clear - RSTCLR (w) */
    Ifx_UReg_32Bit EMSCLR:1;          /**< \brief [11:11] EMS Request Status Clear - EMSCLR (w) */
    Ifx_UReg_32Bit reserved_12:4;     /**< \brief [15:12] \internal Reserved */
    Ifx_UReg_32Bit IRQ0AEMCLR:1;      /**< \brief [16:16] IRQ0 AEM Status Clear - IRQ0AEMCLR (w) */
    Ifx_UReg_32Bit IRQ1AEMCLR:1;      /**< \brief [17:17] IRQ1 AEM Status Clear - IRQ1AEMCLR (w) */
    Ifx_UReg_32Bit IRQ2AEMCLR:1;      /**< \brief [18:18] IRQ2 AEM Status Clear - IRQ2AEMCLR (w) */
    Ifx_UReg_32Bit RST0AEMCLR:1;      /**< \brief [19:19] RST0 AEM Status Clear - RST0AEMCLR (w) */
    Ifx_UReg_32Bit RST1AEMCLR:1;      /**< \brief [20:20] RST1 AEM Status Clear - RST1AEMCLR (w) */
    Ifx_UReg_32Bit RST2AEMCLR:1;      /**< \brief [21:21] RST2 AEM Status Clear - RST2AEMCLR (w) */
    Ifx_UReg_32Bit RST3AEMCLR:1;      /**< \brief [22:22] RST3 AEM Status Clear - RST3AEMCLR (w) */
    Ifx_UReg_32Bit RST4AEMCLR:1;      /**< \brief [23:23] RST4 AEM Status Clear - RST4AEMCLR (w) */
    Ifx_UReg_32Bit RST5AEMCLR:1;      /**< \brief [24:24] RST5 AEM Status Clear - RST5AEMCLR (w) */
    Ifx_UReg_32Bit NMIAEMCLR:1;       /**< \brief [25:25] NMI AEM Status Clear - NMIAEMCLR (w) */
    Ifx_UReg_32Bit RSTAEMCLR:1;       /**< \brief [26:26] RST AEM Status Clear - RSTAEMCLR (w) */
    Ifx_UReg_32Bit EMSAEMCLR:1;       /**< \brief [27:27] EMS AEM Status Clear - EMSAEMCLR (w) */
    Ifx_UReg_32Bit reserved_28:4;     /**< \brief [31:28] \internal Reserved */
} Ifx_SMU_AEXCLR_Bits;

/** \brief Alarm and Fault Counter */
typedef struct _Ifx_SMU_AFCNT_Bits
{
    Ifx_UReg_32Bit FCNT:4;            /**< \brief [3:0] Fault Counter. - FCNT (rh) */
    Ifx_UReg_32Bit ACNT:12;           /**< \brief [15:4] Alarm Counter. - ACNT (rh) */
    Ifx_UReg_32Bit reserved_16:14;    /**< \brief [29:16] \internal Reserved */
    Ifx_UReg_32Bit FCO:1;             /**< \brief [30:30] Fault Counter Overflow. - FCO (rh) */
    Ifx_UReg_32Bit ACO:1;             /**< \brief [31:31] Alarm Counter Overflow. - ACO (rh) */
} Ifx_SMU_AFCNT_Bits;

/** \brief Alarm Status Register */
typedef struct _Ifx_SMU_AG_Bits
{
    Ifx_UReg_32Bit SF0:1;             /**< \brief [0:0] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF1:1;             /**< \brief [1:1] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF2:1;             /**< \brief [2:2] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF3:1;             /**< \brief [3:3] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF4:1;             /**< \brief [4:4] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF5:1;             /**< \brief [5:5] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF6:1;             /**< \brief [6:6] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF7:1;             /**< \brief [7:7] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF8:1;             /**< \brief [8:8] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF9:1;             /**< \brief [9:9] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF10:1;            /**< \brief [10:10] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF11:1;            /**< \brief [11:11] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF12:1;            /**< \brief [12:12] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF13:1;            /**< \brief [13:13] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF14:1;            /**< \brief [14:14] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF15:1;            /**< \brief [15:15] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF16:1;            /**< \brief [16:16] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF17:1;            /**< \brief [17:17] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF18:1;            /**< \brief [18:18] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF19:1;            /**< \brief [19:19] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF20:1;            /**< \brief [20:20] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF21:1;            /**< \brief [21:21] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF22:1;            /**< \brief [22:22] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF23:1;            /**< \brief [23:23] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF24:1;            /**< \brief [24:24] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF25:1;            /**< \brief [25:25] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF26:1;            /**< \brief [26:26] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF27:1;            /**< \brief [27:27] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF28:1;            /**< \brief [28:28] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF29:1;            /**< \brief [29:29] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF30:1;            /**< \brief [30:30] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
    Ifx_UReg_32Bit SF31:1;            /**< \brief [31:31] Status flag for alarm ${z} belonging to alarm group i. - SF${z} (rwh) */
} Ifx_SMU_AG_Bits;

/** \brief Alarm Global Configuration */
typedef struct _Ifx_SMU_AGC_Bits
{
    Ifx_UReg_32Bit IGCS0:3;           /**< \brief [2:0] Interrupt Generation Configuration Set 0 - IGCS0 (rw) */
    Ifx_UReg_32Bit reserved_3:1;      /**< \brief [3:3] \internal Reserved */
    Ifx_UReg_32Bit IGCS1:3;           /**< \brief [6:4] Interrupt Generation Configuration Set 1 - IGCS1 (rw) */
    Ifx_UReg_32Bit reserved_7:1;      /**< \brief [7:7] \internal Reserved */
    Ifx_UReg_32Bit IGCS2:3;           /**< \brief [10:8] Interrupt Generation Configuration Set 2 - IGCS2 (rw) */
    Ifx_UReg_32Bit reserved_11:5;     /**< \brief [15:11] \internal Reserved */
    Ifx_UReg_32Bit RCS:6;             /**< \brief [21:16] CPU Reset Configuration Set - RCS (rw) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit PES:5;             /**< \brief [28:24] Port Emergency Stop - PES (rw) */
    Ifx_UReg_32Bit EFRST:1;           /**< \brief [29:29] Enable FAULT to RUN State Transition - EFRST (rw) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_SMU_AGC_Bits;

