Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSmu_regdef.h
/** \brief Alarm Configuration Register */
typedef struct _Ifx_SMU_AGCF_Bits
{
    Ifx_UReg_32Bit CF0:1;             /**< \brief [0:0] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF1:1;             /**< \brief [1:1] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF2:1;             /**< \brief [2:2] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF3:1;             /**< \brief [3:3] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF4:1;             /**< \brief [4:4] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF5:1;             /**< \brief [5:5] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF6:1;             /**< \brief [6:6] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF7:1;             /**< \brief [7:7] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF8:1;             /**< \brief [8:8] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF9:1;             /**< \brief [9:9] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF10:1;            /**< \brief [10:10] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF11:1;            /**< \brief [11:11] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF12:1;            /**< \brief [12:12] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF13:1;            /**< \brief [13:13] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF14:1;            /**< \brief [14:14] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF15:1;            /**< \brief [15:15] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF16:1;            /**< \brief [16:16] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF17:1;            /**< \brief [17:17] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF18:1;            /**< \brief [18:18] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF19:1;            /**< \brief [19:19] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF20:1;            /**< \brief [20:20] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF21:1;            /**< \brief [21:21] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF22:1;            /**< \brief [22:22] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF23:1;            /**< \brief [23:23] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF24:1;            /**< \brief [24:24] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF25:1;            /**< \brief [25:25] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF26:1;            /**< \brief [26:26] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF27:1;            /**< \brief [27:27] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF28:1;            /**< \brief [28:28] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF29:1;            /**< \brief [29:29] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF30:1;            /**< \brief [30:30] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
    Ifx_UReg_32Bit CF31:1;            /**< \brief [31:31] Configuration flag x (x=0-2) for alarm ${z} belonging to alarm group i. - CF${z} (rw) */
} Ifx_SMU_AGCF_Bits;

/** \brief FSP Configuration Register */
typedef struct _Ifx_SMU_AGFSP_Bits
{
    Ifx_UReg_32Bit FE0:1;             /**< \brief [0:0] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE1:1;             /**< \brief [1:1] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE2:1;             /**< \brief [2:2] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE3:1;             /**< \brief [3:3] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE4:1;             /**< \brief [4:4] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE5:1;             /**< \brief [5:5] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE6:1;             /**< \brief [6:6] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE7:1;             /**< \brief [7:7] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE8:1;             /**< \brief [8:8] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE9:1;             /**< \brief [9:9] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE10:1;            /**< \brief [10:10] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE11:1;            /**< \brief [11:11] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE12:1;            /**< \brief [12:12] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE13:1;            /**< \brief [13:13] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE14:1;            /**< \brief [14:14] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE15:1;            /**< \brief [15:15] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE16:1;            /**< \brief [16:16] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE17:1;            /**< \brief [17:17] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE18:1;            /**< \brief [18:18] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE19:1;            /**< \brief [19:19] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE20:1;            /**< \brief [20:20] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE21:1;            /**< \brief [21:21] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE22:1;            /**< \brief [22:22] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE23:1;            /**< \brief [23:23] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE24:1;            /**< \brief [24:24] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE25:1;            /**< \brief [25:25] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE26:1;            /**< \brief [26:26] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE27:1;            /**< \brief [27:27] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE28:1;            /**< \brief [28:28] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE29:1;            /**< \brief [29:29] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE30:1;            /**< \brief [30:30] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
    Ifx_UReg_32Bit FE31:1;            /**< \brief [31:31] Fault signaling configuration flag for alarm ${z} belonging to alarm group i. - FE${z} (rw) */
} Ifx_SMU_AGFSP_Bits;

/** \brief Clock Control Register */
typedef struct _Ifx_SMU_CLC_Bits
{
    Ifx_UReg_32Bit DISR:1;            /**< \brief [0:0] Module Disable Request Bit - DISR (rw) */
    Ifx_UReg_32Bit DISS:1;            /**< \brief [1:1] Module Disable Status Bit - DISS (rh) */
    Ifx_UReg_32Bit FDIS:1;            /**< \brief [2:2] Force Disable - FDIS (rw) */
    Ifx_UReg_32Bit EDIS:1;            /**< \brief [3:3] Sleep Mode Enable Control - EDIS (rw) */
    Ifx_UReg_32Bit reserved_4:28;     /**< \brief [31:4] \internal Reserved */
} Ifx_SMU_CLC_Bits;

