Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSmu_regdef.h
/** \brief Command Register */
typedef struct _Ifx_SMU_CMD_Bits
{
    Ifx_UReg_32Bit CMD:4;             /**< \brief [3:0] Implements the SMU Command Interface. - CMD (w) */
    Ifx_UReg_32Bit ARG:4;             /**< \brief [7:4] Implements the SMU Command Interface. - ARG (w) */
    Ifx_UReg_32Bit reserved_8:24;     /**< \brief [31:8] \internal Reserved */
} Ifx_SMU_CMD_Bits;

/** \brief Debug Register */
typedef struct _Ifx_SMU_DBG_Bits
{
    Ifx_UReg_32Bit SSM:2;             /**< \brief [1:0] Running state of the SMU State Machine - SSM (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_SMU_DBG_Bits;

/** \brief Fault Signaling Protocol */
typedef struct _Ifx_SMU_FSP_Bits
{
    Ifx_UReg_32Bit PRE1:3;            /**< \brief [2:0] Prescaler1 - PRE1 (rw) */
    Ifx_UReg_32Bit PRE2:2;            /**< \brief [4:3] Prescaler2 - PRE2 (rw) */
    Ifx_UReg_32Bit MODE:2;            /**< \brief [6:5] Fault Signaling Protocol configuration - MODE (rw) */
    Ifx_UReg_32Bit PES:1;             /**< \brief [7:7] Port Emergency Stop (PES) - PES (rw) */
    Ifx_UReg_32Bit TFSP_LOW:14;       /**< \brief [21:8] Specifies the FSP fault state duration - TFSP_LOW (r) */
    Ifx_UReg_32Bit TFSP_HIGH:10;      /**< \brief [31:22] Specifies the FSP fault state duration - TFSP_HIGH (rw) */
} Ifx_SMU_FSP_Bits;

/** \brief Module Identification Register */
typedef struct _Ifx_SMU_ID_Bits
{
    Ifx_UReg_32Bit MOD_REV:8;         /**< \brief [7:0] Module Revision Number - MOD_REV (r) */
    Ifx_UReg_32Bit MOD_TYPE:8;        /**< \brief [15:8] Module Type - MOD_TYPE (r) */
    Ifx_UReg_32Bit MOD_NUMBER:16;     /**< \brief [31:16] Module Number Value - MOD_NUMBER (r) */
} Ifx_SMU_ID_Bits;

/** \brief Key Register */
typedef struct _Ifx_SMU_KEYS_Bits
{
    Ifx_UReg_32Bit CFGLCK:8;          /**< \brief [7:0] Configuration Lock - CFGLCK (rw) */
    Ifx_UReg_32Bit PERLCK:8;          /**< \brief [15:8] Permanent Lock - PERLCK (rw) */
    Ifx_UReg_32Bit reserved_16:16;    /**< \brief [31:16] \internal Reserved */
} Ifx_SMU_KEYS_Bits;

/** \brief SMU Reset Register 0 */
typedef struct _Ifx_SMU_KRST0_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit RSTSTAT:1;         /**< \brief [1:1] Kernel Reset Status - RSTSTAT (rh) */
    Ifx_UReg_32Bit reserved_2:30;     /**< \brief [31:2] \internal Reserved */
} Ifx_SMU_KRST0_Bits;

/** \brief SMU Reset Register 1 */
typedef struct _Ifx_SMU_KRST1_Bits
{
    Ifx_UReg_32Bit RST:1;             /**< \brief [0:0] Kernel Reset - RST (rwh) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_SMU_KRST1_Bits;

/** \brief SMU Reset Status Clear Register */
typedef struct _Ifx_SMU_KRSTCLR_Bits
{
    Ifx_UReg_32Bit CLR:1;             /**< \brief [0:0] Kernel Reset Status Clear - CLR (w) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_SMU_KRSTCLR_Bits;

/** \brief OCDS Control and Status */
typedef struct _Ifx_SMU_OCS_Bits
{
    Ifx_UReg_32Bit TGS:2;             /**< \brief [1:0] Trigger Set for OTGB0/1 - TGS (rw) */
    Ifx_UReg_32Bit TGB:1;             /**< \brief [2:2] OTGB0/1 Bus Select - TGB (rw) */
    Ifx_UReg_32Bit TG_P:1;            /**< \brief [3:3] TGS, TGB Write Protection - TG_P (w) */
    Ifx_UReg_32Bit reserved_4:20;     /**< \brief [23:4] \internal Reserved */
    Ifx_UReg_32Bit SUS:4;             /**< \brief [27:24] OCDS Suspend Control - SUS (rw) */
    Ifx_UReg_32Bit SUS_P:1;           /**< \brief [28:28] SUS Write Protection - SUS_P (w) */
    Ifx_UReg_32Bit SUSSTA:1;          /**< \brief [29:29] Suspend State - SUSSTA (rh) */
    Ifx_UReg_32Bit reserved_30:2;     /**< \brief [31:30] \internal Reserved */
} Ifx_SMU_OCS_Bits;

/** \brief Port Control */
typedef struct _Ifx_SMU_PCTL_Bits
{
    Ifx_UReg_32Bit HWDIR:1;           /**< \brief [0:0] Port Direction. - HWDIR (rw) */
    Ifx_UReg_32Bit HWEN:1;            /**< \brief [1:1] Port Enable. - HWEN (rw) */
    Ifx_UReg_32Bit reserved_2:5;      /**< \brief [6:2] \internal Reserved */
    Ifx_UReg_32Bit PCS:1;             /**< \brief [7:7] PAD Configuration Select - PCS (rw) */
    Ifx_UReg_32Bit reserved_8:6;      /**< \brief [13:8] \internal Reserved */
    Ifx_UReg_32Bit PCFG:18;           /**< \brief [31:14] PAD Configuration - PCFG (rh) */
} Ifx_SMU_PCTL_Bits;

/** \brief Register Monitor Control */
typedef struct _Ifx_SMU_RMCTL_Bits
{
    Ifx_UReg_32Bit TE:1;              /**< \brief [0:0] Test Enable. - TE (rw) */
    Ifx_UReg_32Bit reserved_1:31;     /**< \brief [31:1] \internal Reserved */
} Ifx_SMU_RMCTL_Bits;

/** \brief Register Monitor Error Flags */
typedef struct _Ifx_SMU_RMEF_Bits
{
    Ifx_UReg_32Bit EF0:1;             /**< \brief [0:0] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF1:1;             /**< \brief [1:1] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF2:1;             /**< \brief [2:2] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF3:1;             /**< \brief [3:3] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF4:1;             /**< \brief [4:4] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF5:1;             /**< \brief [5:5] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF6:1;             /**< \brief [6:6] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF7:1;             /**< \brief [7:7] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF8:1;             /**< \brief [8:8] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF9:1;             /**< \brief [9:9] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF10:1;            /**< \brief [10:10] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF11:1;            /**< \brief [11:11] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF12:1;            /**< \brief [12:12] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF13:1;            /**< \brief [13:13] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF14:1;            /**< \brief [14:14] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF15:1;            /**< \brief [15:15] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF16:1;            /**< \brief [16:16] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF17:1;            /**< \brief [17:17] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit EF18:1;            /**< \brief [18:18] Status flag related to the different instances of the register monitor safety mechanism. - EF${z} (rwh) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_SMU_RMEF_Bits;

