Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSmu_regdef.h
/** \brief Register Monitor Self Test Status */
typedef struct _Ifx_SMU_RMSTS_Bits
{
    Ifx_UReg_32Bit STS0:1;            /**< \brief [0:0] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS1:1;            /**< \brief [1:1] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS2:1;            /**< \brief [2:2] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS3:1;            /**< \brief [3:3] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS4:1;            /**< \brief [4:4] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS5:1;            /**< \brief [5:5] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS6:1;            /**< \brief [6:6] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS7:1;            /**< \brief [7:7] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS8:1;            /**< \brief [8:8] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS9:1;            /**< \brief [9:9] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS10:1;           /**< \brief [10:10] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS11:1;           /**< \brief [11:11] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS12:1;           /**< \brief [12:12] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS13:1;           /**< \brief [13:13] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS14:1;           /**< \brief [14:14] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS15:1;           /**< \brief [15:15] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS16:1;           /**< \brief [16:16] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS17:1;           /**< \brief [17:17] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit STS18:1;           /**< \brief [18:18] Ready flag related to the different instances of the register monitor safety mechanism. - STS${z} (rwh) */
    Ifx_UReg_32Bit reserved_19:13;    /**< \brief [31:19] \internal Reserved */
} Ifx_SMU_RMSTS_Bits;

/** \brief Recovery Timer ${i} Alarm Configuration 0 */
typedef struct _Ifx_SMU_RTAC_RTAC0_Bits
{
    Ifx_UReg_32Bit GID0:4;            /**< \brief [3:0] Group Index 0. - GID0 (rw) */
    Ifx_UReg_32Bit ALID0:5;           /**< \brief [8:4] Alarm Identifier 0. - ALID0 (rw) */
    Ifx_UReg_32Bit reserved_9:7;      /**< \brief [15:9] \internal Reserved */
    Ifx_UReg_32Bit GID1:4;            /**< \brief [19:16] Group Index 1. - GID1 (rw) */
    Ifx_UReg_32Bit ALID1:5;           /**< \brief [24:20] Alarm Identifier 1. - ALID1 (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_SMU_RTAC_RTAC0_Bits;

/** \brief Recovery Timer ${i} Alarm Configuration 1 */
typedef struct _Ifx_SMU_RTAC_RTAC1_Bits
{
    Ifx_UReg_32Bit GID2:4;            /**< \brief [3:0] Group Index 2. - GID2 (rw) */
    Ifx_UReg_32Bit ALID2:5;           /**< \brief [8:4] Alarm Identifier 0. - ALID2 (rw) */
    Ifx_UReg_32Bit reserved_9:7;      /**< \brief [15:9] \internal Reserved */
    Ifx_UReg_32Bit GID3:4;            /**< \brief [19:16] Group Index 3. - GID3 (rw) */
    Ifx_UReg_32Bit ALID3:5;           /**< \brief [24:20] Alarm Identifier 1. - ALID3 (rw) */
    Ifx_UReg_32Bit reserved_25:7;     /**< \brief [31:25] \internal Reserved */
} Ifx_SMU_RTAC_RTAC1_Bits;

/** \brief Recovery Timer Configuration */
typedef struct _Ifx_SMU_RTC_Bits
{
    Ifx_UReg_32Bit RT0E:1;            /**< \brief [0:0] RT0 Enable Bit - RT0E (rw) */
    Ifx_UReg_32Bit RT1E:1;            /**< \brief [1:1] RT1 Enable Bit - RT1E (rw) */
    Ifx_UReg_32Bit reserved_2:6;      /**< \brief [7:2] \internal Reserved */
    Ifx_UReg_32Bit RTD:24;            /**< \brief [31:8] Recovery Timer Duration - RTD (rw) */
} Ifx_SMU_RTC_Bits;

/** \brief Status Register */
typedef struct _Ifx_SMU_STS_Bits
{
    Ifx_UReg_32Bit CMD:4;             /**< \brief [3:0] Last command received - CMD (rwh) */
    Ifx_UReg_32Bit ARG:4;             /**< \brief [7:4] Last command argument received - ARG (rwh) */
    Ifx_UReg_32Bit RES:1;             /**< \brief [8:8] Result of last received command - RES (rwh) */
    Ifx_UReg_32Bit ASCE:1;            /**< \brief [9:9] Alarm Status Clear Enable - ASCE (rwh) */
    Ifx_UReg_32Bit FSP:2;             /**< \brief [11:10] Fault Signaling Protocol status - FSP (rh) */
    Ifx_UReg_32Bit FSTS:1;            /**< \brief [12:12] Fault State Timing Status - FSTS (rwh) */
    Ifx_UReg_32Bit reserved_13:3;     /**< \brief [15:13] \internal Reserved */
    Ifx_UReg_32Bit RTS0:1;            /**< \brief [16:16] Recovery Timer 0 Status - RTS0 (rwh) */
    Ifx_UReg_32Bit RTME0:1;           /**< \brief [17:17] Recovery Timer 0 Missed Event - RTME0 (rwh) */
    Ifx_UReg_32Bit RTS1:1;            /**< \brief [18:18] Recovery Timer 1 Status - RTS1 (rwh) */
    Ifx_UReg_32Bit RTME1:1;           /**< \brief [19:19] Recovery Timer 1 Missed Event - RTME1 (rwh) */
    Ifx_UReg_32Bit reserved_20:10;    /**< \brief [29:20] \internal Reserved */
    Ifx_UReg_32Bit GFSCU_EN:1;        /**< \brief [30:30] Glitch Filter for FSP to SCU enable - GFSCU_EN (r) */
    Ifx_UReg_32Bit GFSTS_EN:1;        /**< \brief [31:31] Glitch Filter for FSP to SMU_STS enable - GFSTS_EN (r) */
} Ifx_SMU_STS_Bits;

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_smu_union
 * \{   */
/** \brief SMU Access Enable Register 0   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_ACCEN0_Bits B;            /**< \brief Bitfield access */
} Ifx_SMU_ACCEN0;

/** \brief SMU Access Enable Register 1   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_ACCEN1_Bits B;            /**< \brief Bitfield access */
} Ifx_SMU_ACCEN1;

/** \brief Alarm Debug Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_AD_Bits B;                /**< \brief Bitfield access */
} Ifx_SMU_AD;

/** \brief Alarm Executed Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_AEX_Bits B;               /**< \brief Bitfield access */
} Ifx_SMU_AEX;

/** \brief Alarm Executed Status Clear Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_AEXCLR_Bits B;            /**< \brief Bitfield access */
} Ifx_SMU_AEXCLR;

/** \brief Alarm and Fault Counter   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_AFCNT_Bits B;             /**< \brief Bitfield access */
} Ifx_SMU_AFCNT;

/** \brief Alarm Status Register   */
typedef union
{
    Ifx_UReg_32Bit U;                 /**< \brief Unsigned access */
    Ifx_SReg_32Bit I;                 /**< \brief Signed access */
    Ifx_SMU_AG_Bits B;                /**< \brief Bitfield access */
} Ifx_SMU_AG;

